; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v2)
		(pred_6 ?v8)
		(pred_1 ?v6)
		(pred_4 ?v6)
		(pred_5 ?v8 ?v6)
		(pred_2)
		(pred_3 ?v8))

   (:action op_1
       :parameters  (?v5 ?v4)
       :precondition (and (not-eq ?v5 ?v4) 
                          (pred_1 ?v5) (pred_1 ?v4) (pred_4 ?v5))
       :effect (and  (pred_4 ?v4)
		     (not (pred_4 ?v5))))


   (:action op_2
       :parameters (?v7 ?v3)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v3)
			    (pred_5 ?v7 ?v3) (pred_4 ?v3) (pred_2))
       :effect (and (pred_3 ?v7)
		    (not (pred_5 ?v7 ?v3)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v7  ?v3)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v3)
			    (pred_3 ?v7) (pred_4 ?v3))
       :effect (and (pred_5 ?v7 ?v3)
		    (pred_2)
		    (not (pred_3 ?v7)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_04 obj_06 
          obj_03 obj_01 obj_05 
)
(:init
(pred_1 obj_02)
(pred_1 obj_04)
(pred_1 obj_06)
(pred_6 obj_03)
(pred_6 obj_01)
(pred_6 obj_05)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(pred_2)
(pred_5 obj_03 obj_04)
(pred_5 obj_01 obj_02)
(pred_5 obj_05 obj_04)
(pred_4 obj_04)
)
(:goal
(and
(pred_5 obj_03 obj_06)
(pred_5 obj_01 obj_04)
(pred_5 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_06) (pred_4 obj_02))
    (sometime-before  (pred_5 obj_01 obj_04) (pred_4 obj_06))
  )
)
)

; plan
1. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_03 obj_04) (pred_2)
   added: (pred_3 obj_03)
   goals met: 1 of 3
2. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_06)
   goals met: 1 of 3
3. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 1 of 3
4. (op_3 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_5 obj_03 obj_02) (pred_2)
   goals met: 1 of 3
5. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_2)
   added: (pred_3 obj_01)
   goals met: 1 of 3
6. (op_1 obj_02 obj_04)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_04)
   goals met: 1 of 3
7. (op_3 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_04) (pred_2)
   goals met: 2 of 3
8. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_06)
   goals met: 2 of 3
9. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 2 of 3
10. (op_2 obj_03 obj_02)
   deleted: (pred_5 obj_03 obj_02) (pred_2)
   added: (pred_3 obj_03)
   goals met: 2 of 3
11. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 2 of 3
12. (op_3 obj_03 obj_06)
   deleted: (pred_3 obj_03)
   added: (pred_5 obj_03 obj_06) (pred_2)
   goals met: 3 of 3
